9/data/attachments/db1b445daf46bff6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_939e287c-39e9-4206-bdff-c75e5898395a</nif:username>
            <nif:friendToBeAdded>Matthew_less_Friend_36975_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>